       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATING.
       AUTHOR. theluqmn.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       END PROGRAM DATING.