       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATING.
       AUTHOR. theluqmn.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *logic variables
       01 COUNTER                  PIC 9(4).
       01 WS-CURRENT-DATE          PIC 9(8).
       01 WS-CURRENT-DATE-REDEF REDEFINES WS-CURRENT-DATE.
           05 WS-CURRENT-YEAR      PIC 9(4).
           05 WS-CURRENT-MONTH     PIC 9(2).
           05 WS-CURRENT-DAY       PIC 9(2).

       PROCEDURE DIVISION.
       ACCEPT WS-CURRENT-DATE FROM DATE YYYYMMDD.
       DISPLAY "DATING - date calculation tool".
       DISPLAY WS-CURRENT-DATE.
       DISPLAY WS-CURRENT-YEAR.
       MOVE 20090416 TO WS-CURRENT-DATE.
       DISPLAY WS-CURRENT-DATE.
       END PROGRAM DATING.
